Autodesk.Revit.DB.ThermalAsset.EqualsThermalOnly(Autodesk.Revit.DB.ThermalAsset)
Determines whether this thermal asset is equal to another, but ignore data from base class.
other:
The thermal asset to compare with this one.
Returns:
True if the given thermal asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Equals(Autodesk.Revit.DB.ThermalAsset)
Determines whether this thermal asset is equal to another.
other:
The thermal asset to compare with this one.
Returns:
True if the given thermal asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Name
The name of the thermal asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ThermalAsset.#ctor(System.String,Autodesk.Revit.DB.ThermalMaterialType)
Constructs an instance of ThermalAsset.
name:
The name of the asset.
materialType:
The type of thermal material that this asset will describe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013